cmsis-svd/cmsis-svd/data/NXP/LPC11D14_svd_v4.svd
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode. See Section 7.1 for part specific details.</description>
					<bitRange>[10:10]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
										

				</field>
			</fields>
		</register>
		<register>
			<name>SCK_LOC</name>
			<description>SCK pin location select register</description>
			<addressOffset>0x0B0</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SCKLOC</name>
					<description>Selects pin location for SCK0 pin.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>PIO0_10</name>
							<description>Selects SCK0 function in pin location SWCLK/PIO0_10/SCK0/CT16B0_MAT2 (see Table 80).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO2_11</name>
							<description>Selects SCK0 function in pin location PIO2_11/SCK0 (see Table 82.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO0_6</name>
							<description>Selects SCK0 function in pin location PIO0_6/SCK0 (see Table 73).</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
										

				</field>
			</fields>
		</register>
		<register>
			<name>DSR_LOC</name>
			<description>DSR pin location select register</description>
			<addressOffset>0x0B4</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DSRLOC</name>
					<description>Selects pin location for DSR0 pin.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>PIO2_1</name>
							<description>Selects  DSR function in pin location PIO2_1/DSR/SCK1.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO3_1</name>
							<description>Selects DSR function in pin location PIO3_1/DSR.</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
										

				</field>
			</fields>
		</register>
		<register>
			<name>DCD_LOC</name>
			<description>DCD pin location select register</description>
			<addressOffset>0x0B8</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DCDLOC</name>
					<description>Selects pin location for DCD pin.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>PIO2_2</name>
							<description>Selects  DCD function in pin location PIO2_2/DCD/MISO1.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO3_2</name>
							<description>Selects DCD function in pin location PIO3_2/DCD.</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
										

				</field>
			</fields>
		</register>
		<register>
			<name>RI_LOC</name>
			<description>RI pin location register</description>
			<addressOffset>0x0BC</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RILOC</name>
					<description>Selects pin location for RI pin.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>PIO2_3</name>
							<description>Selects  RI function in pin location PIO2_3/RI/MOSI1.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO3_3</name>
							<description>Selects RI function in pin location PIO3_3/RI.</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
										

				</field>
			</fields>
		</register>
										
										
	</registers>
</peripheral>

	<peripheral>
        <name>SYSCON</name>
        <description>System configuration</description>
        <groupName>SYSCON</groupName>
        <baseAddress>0x40048000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>BOD</name>
			<value>26</value>
		</interrupt>
		<interrupt>
			<name>PIO0_0</name>
			<value>0</value>
		</interrupt>
		<interrupt>
			<name>PIO0_1</name>
			<value>1</value>
		</interrupt>
		<interrupt>
			<name>PIO0_2</name>
			<value>2</value>
		</interrupt>
		<interrupt>
			<name>PIO0_3</name>
			<value>3</value>
		</interrupt>
		<interrupt>
			<name>PIO0_4</name>
			<value>4</value>
		</interrupt>
		<interrupt>
			<name>PIO0_5</name>
			<value>5</value>
		</interrupt>
		<interrupt>
			<name>PIO0_6</name>
			<value>6</value>
		</interrupt>
		<interrupt>
			<name>PIO0_7</name>
			<value>7</value>
		</interrupt>
		<interrupt>
			<name>PIO0_8</name>
			<value>8</value>
		</interrupt>
		<interrupt>
			<name>PIO0_9</name>
			<value>9</value>
		</interrupt>
		<interrupt>
			<name>PIO0_10</name>
			<value>10</value>
		</interrupt>
		<interrupt>
			<name>PIO0_11</name>
			<value>11</value>
		</interrupt>
		<interrupt>
			<name>PIO1_0</name>
			<value>12</value>
		</interrupt>
		<registers>
		<register>
			<name>SYSMEMREMAP</name>
			<description>System memory remap</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x002</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MAP</name>
					<description>System memory remap</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BOOT_LOADER_MODE_IN</name>
							<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_RAM_MODE_INTER</name>
							<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_FLASH_MODE_INT</name>
							<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

